<?php return [
    'part' => [
        'p' => [
            ['s', '音素类型(b:爆破, p:等待, s:无声音, c:元音, v:辅音)'],
            ['s', '上上个音素'],
            ['s', '上个音素'],
            ['s', '当前音素'],
            ['s', '下个音素'],
            ['s', '下下个音素'],
            ['s', '上上个音的表情'],
            ['s', '上个音的表情'],
            ['s', '当前音的表情'],
            ['s', '下个音的表情'],
            ['s', '下下个音的表情'],
        ],
        'a' => [
            ['d', '上一个音距离本句开头的音素数'],
            ['d', '上一个音距离本句结尾的音素数'],
            ['d', '上一个音距离音符开头的音素数'],
            ['d', '上一个音距离音符结尾的音素数'],
        ],
        'b' => [
            ['d', '当前音距离本句开头的音素数'],
            ['d', '当前音距离本句结尾的音素数'],
            ['d', '当前音距离本句结尾的时间（10毫秒）'],
            ['d', '当前音距离本句结尾的时间（10毫秒）'],
            ['d', '当前音距离音符开头的音素数'],
            ['d', '当前音距离音符结尾的音素数'],
            ['d', '当前音符距离本句开头的音素数'],
            ['d', '当前音符距离本句结尾的音素数'],
        ],
        'c' => [
            ['d', '下一个音距离本句开头的音素数'],
            ['d', '下一个音距离本句结尾的音素数'],
            ['d', '下一个音距离音符开头的音素数'],
            ['d', '下一个音距离音符结尾的音素数'],
        ],
        'd' => [
            ['s', '上一个音的绝对音高(国际音高表示法)'],
            ['d', '上一个音的BPM'],
            ['s', '上一个音的语言'],
        ],
        'e' => [
            ['s', '当前音的绝对音高(国际音高表示法)'],
            ['d', '当前音的BPM'],
            ['s', '当前音的语言'],
            ['d', '与前一个音的音高差(半音)'],
            ['d', '与后一个音的音高差(半音)'],

        ],
        'f' => [
            ['s', '下一个音的绝对音高(国际音高表示法)'],
            ['d', '下一个音的BPM'],
            ['s', '下一个音的语言'],
        ],
    ],
];
?>